pixpals/app/controllers/avatars_controller.rb

SELECT "avatars".* FROM "avatars"
---
  def index
    @avatars = Avatar.all

INSERT INTO "avatars" ("base", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["base", "piclink.com"], ["user_id", 1], ["created_at", "2020-02-11 16:14:57.040887"], ["updated_at", "2020-02-11 16:14:57.040887"]]
---
  def create
    @avatar = current_user.avatar.create!(avatar_params)

UPDATE "avatars" SET "user_id" = ?, "outfit" = ?, "updated_at" = ? WHERE "avatars"."id" = ?  [["user_id", 2], ["outfit", "/images/outfits/vamp_purple.png"], ["updated_at", "2020-02-13 20:49:22.132127"], ["id", 2]]
---
  def update
    @avatar.update(avatar_params)

SELECT "avatars".* FROM "avatars" WHERE "avatars"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_avatar
    @avatar = Avatar.find(params[:id])