pixpals/app/controllers/comments_controller.rb

  def create
    @avatar.comments.create!(comment_params)
---
INSERT INTO "comments" ("content", "created_by", "avatar_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "heyyy"], ["created_by", "1"], ["avatar_id", 1], ["created_at", "2020-02-11 16:19:13.428899"], ["updated_at", "2020-02-11 16:19:13.428899"]]

  def destroy
    @comment.destroy
---
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 3]]

  def set_avatar
    @avatar = Avatar.find(params[:avatar_id])
---
SELECT "avatars".* FROM "avatars" WHERE "avatars"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def set_comment
    @comment = @avatar.comments.find_by!(id: params[:id]) if @avatar
---
SELECT "comments".* FROM "comments" WHERE "comments"."avatar_id" = ? AND "comments"."id" = ? LIMIT ?  [["avatar_id", 1], ["id", 3], ["LIMIT", 1]]