pixpals/app/controllers/inventories_controller.rb

  def create
    @item = Item.find(params[:id])
    @current_user.inventories << @item
---
SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "inventories" ("item_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["item_id", 1], ["user_id", 1], ["created_at", "2020-02-13 15:43:31.899834"], ["updated_at", "2020-02-13 15:43:31.899834"]]

  def index
    @inventories = Inventory.find(session[:user_id])
---
SELECT "inventories".* FROM "inventories" WHERE "inventories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]