pixpals/app/controllers/inventories_controller.rb

  def destroy
    @inventory = Inventory.find(params[:id])
    @inventory.destroy
---
SELECT "inventories".* FROM "inventories" WHERE "inventories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "inventories" WHERE "inventories"."id" = ?  [["id", 1]]