pixpals/app/controllers/users_controller.rb

  def create
    user = User.create!(user_params)
---
INSERT INTO "users" ("username", "email", "password_digest", "currency", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def update
    @current_user.update(user_params)
---
UPDATE "users" SET "currency" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["currency", 400], ["updated_at", "2020-02-13 22:01:15.281834"], ["id", 2]]

  def show
    @user = User.find_by_username(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "cor"], ["LIMIT", 1]]